{
    "extensionName": {
        "message": "Super Vue Partagée"
    },
    "extensionDescription": {
        "message": "Affiche les onglets sélectionnés en vue partagée, soit dans un nouvel onglet, soit dans de nouvelles fenêtres."
    },
    "browserActionTitle": {
        "message": "Créer une vue partagée"
    },
    "optionsTitle": {
        "message": "Options de Super Vue Partagée"
    },
    "optionsLegend": {
        "message": "Choisissez le mode de fonctionnement :"
    },
    "optionsModeWindowLabel": {
        "message": "Mode Mosaïque de Fenêtres (Recommandé)"
    },
    "optionsModeWindowDescription": {
        "message": "Crée de nouvelles fenêtres de navigateur. Conserve toutes les fonctionnalités (barre d'adresse, etc.). Les autres extensions (ex: bloqueurs de pubs) fonctionnent normalement."
    },
    "optionsModeTabLayout": {
        "message": "Mode Onglet Unique (Iframes)"
    },
    "optionsModeTabDescription": {
        "message": "Affiche tout dans un seul onglet. Look élégant, mais certains sites nécessitent un forçage. Note : Les autres extensions (ex: bloqueurs de pubs) ne fonctionneront pas dans ce mode."
    },
    "optionsSavedStatus": {
        "message": "Options sauvegardées."
    },
    "alertSelectTabs": {
        "message": "Veuillez sélectionner au moins deux onglets avec des pages web chargées."
    },
    "optionsLanguageWarning": {
        "message": "Note : Un redémarrage du navigateur est nécessaire pour que les changements de langue prennent pleinement effet dans l'extension."
    },
    "contextMenuTitle": {
        "message": "Ajouter à une vue partagée existante..."
    },
    "maxTabsAlert": {
        "message": "Maximum de 4 onglets atteint. Vous ne pouvez pas en ajouter plus à cette vue."
    },
    "optionsHelpLink": {
        "message": "❓ Consulter le guide d'utilisation"
    },
    "dialogTitle": {
        "message": "Mode d'affichage modifié"
    },
    "dialogMessage": {
        "message": "Pour des raisons de sécurité, l'un des sites web sélectionnés ne permet pas d'être affiché groupé dans un seul onglet. C'est pourquoi Super Vue Partagée a ouvert les pages dans des fenêtres séparées."
    },
    "dialogCheckboxLabel": {
        "message": "Ne plus afficher ce message"
    },
    "dialogConfirmButton": {
        "message": "Compris"
    },
    "optionsShowDialogLabel": {
        "message": "Afficher l'avertissement quand un site web force le Mode Fenêtres"
    },
    "optionsForceWindowLabel": {
        "message": "Sites à toujours ouvrir en Mode Fenêtre"
    },
    "optionsForceWindowDescription": {
        "message": "Entrez un domaine par ligne (ex: mozilla.org). Ces sites ignoreront toujours le paramètre Mode Onglet Unique."
    },
    "forceInfoTitle": {
        "message": "Forçage d'affichage activé"
    },
    "forceInfoMessage": {
        "message": "Ce site (__DOMAIN__) interdit normalement son affichage dans un cadre pour des raisons de sécurité. Super Vue Partagée a contourné cette restriction pour vous l'afficher.<br><br>Pour désactiver ce forçage et toujours ouvrir ce site dans une fenêtre séparée, ajoutez le domaine suivant à la liste dans les options de l'extension :"
    },
    "forceInfoButton": {
        "message": "Ouvrir les options"
    },
    "forceShowPage": {
        "message": "Afficher quand même"
    },
    "welcomeTitle": {
        "message": "Bienvenue dans Super Vue Partagée !"
    },
    "welcomeSubtitle": {
        "message": "Voici un guide rapide pour maîtriser la productivité multi-onglets."
    },
    "welcomeHeader1": {
        "message": "1. Créer votre première vue partagée (Mode Onglet)"
    },
    "welcomeStep1_1": {
        "message": "Sélectionnez 2 à 4 onglets en maintenant la touche <code>Cmd</code> (Mac) ou <code>Ctrl</code> (Windows) enfoncée et en cliquant sur eux."
    },
    "welcomeStep1_2": {
        "message": "Cliquez sur l'icône de l'extension <img src='icons/icon-48.png' class='inline-icon'> dans votre barre d'outils."
    },
    "welcomeStep1_3": {
        "message": "Et voilà ! Un nouvel onglet s'ouvre avec vos pages côte à côte."
    },
    "welcomeHeader2": {
        "message": "2. Gérer votre vue"
    },
    "welcomeStep2_1": {
        "message": "<strong>Nommez votre vue :</strong> Cliquez sur le champ en haut de la vue partagée (ex: \"Split - 123...\") et donnez-lui un nom clair comme \"Recherche Projet X\"."
    },
    "welcomeStep2_2": {
        "message": "<strong>Retirez un panneau :</strong> Cliquez sur le petit bouton <code>×</code> à droite de la barre d'adresse d'un panneau pour le retirer."
    },
    "welcomeStep2_3": {
        "message": "<strong>Fermez toute la vue :</strong> Cliquez sur le gros bouton <code>X</code> en haut à droite."
    },
    "welcomeHeader3": {
        "message": "3. Ajouter un onglet à une vue existante"
    },
    "welcomeStep3_1": {
        "message": "Créez une vue partagée (voir étape 1)."
    },
    "welcomeStep3_2": {
        "message": "Allez sur un autre onglet que vous souhaitez ajouter."
    },
    "welcomeStep3_3": {
        "message": "Faites un <strong>clic droit</strong> sur cet onglet."
    },
    "welcomeStep3_4": {
        "message": "Dans le menu, allez sur \"Ajouter à une vue partagée existante...\" et choisissez votre vue par son nom."
    },
    "welcomeHeader4": {
        "message": "4. Limitations"
    },
    "welcomeP4_1": {
        "message": "Pour des raisons de sécurité imposées par les navigateurs, lorsque vous utilisez le <strong>Mode Onglet Unique (Iframes)</strong>, les autres extensions (bloqueurs de pubs, gestionnaires de mots de passe, etc.) ne peuvent pas interagir avec le contenu des panneaux."
    },
    "welcomeP4_2": {
        "message": "Pour profiter de toutes les fonctionnalités de vos autres extensions, nous vous recommandons d'utiliser le <strong>Mode Mosaïque de Fenêtres</strong>."
    },
    "welcomeFooter": {
        "message": "<strong>Astuce :</strong> Vous préférez que les vues s'ouvrent dans des fenêtres séparées ? Allez dans les <a href='#' class='options-link'>options de l'extension</a> et choisissez le \"Mode Mosaïque de Fenêtres\"."
    },
    "welcomeWarningTitle": {
        "message": "AVERTISSEMENT"
    },
    "welcomeWarningP1": {
        "message": "Certains sites web (banques, réseaux sociaux, etc.) possèdent des sécurités qui les empêchent de s'afficher à l'intérieur d'une autre page (dans un iframe)."
    },
    "welcomeWarningImage": {
        "message": "<img src='need-windows.png' alt='Message Firefox ne peut pas ouvrir cette page'>"
    },
    "welcomeWarningP2": {
        "message": "Quand vous essaierez de diviser ces sites en 'Mode Onglet Unique', l'extension les forcera à s'afficher. Un message d'information apparaîtra par-dessus le contenu."
    },
    "welcomeWarningP3": {
        "message": "Pour éviter ce forçage, vous pouvez ajouter les domaines concernés dans une liste sur la <a href='#' class='options-link'>page d'options</a> de l'extension. Cela les fera toujours s'ouvrir en 'Mode Mosaïque de Fenêtres'."
    },
    "linkGitHubText": {
        "message": "Cette extension est open source. Le code source est disponible sur <a href='https://github.com/NaviStorm/split-multi' target='_blank' rel='noopener'>GitHub</a>."
    }
}